# Atlas Tyres wishes to increase their tyre sales and improve their brand.
The data given is based on the cost and number of sales for the period of 
January 2019 - June 2019

Visualization of the data can be in terms if:
1. Inwards vs Outwards sales cost for each tyre type
2. Count of number of tyres sold per month for the 6 months (total sum of tyres per month)
3. Highest/lowest selling tyres in count form
4. Highest/lowest selling tyres in cost form

Opening Balance: Sales at the start of January
Inwards: Additional stock			
Outwards: Sales made between Jan-June
Closing Balance:  Remaining stock after sales are made

In [4]:
import pandas as pd
import numpy as np
#import seaborn as sns
#mport matplotlib.pyplot as plt

import fastai

In [20]:
import seaborn as sns

ModuleNotFoundError: No module named 'seaborn'

In [6]:
pd.read_csv('Copy_ATLAS_TYRES_Stock Summary.csv', nrows=4)

,Unnamed: 0,Opening Balance,Unnamed: 2,Unnamed: 3,Inwards,Unnamed: 5,Unnamed: 6,Outwards,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Closing Balance,Unnamed: 15,Unnamed: 16
0,NaN,Quantity,Rate,Value,Quantity,Rate,Value,Quantity,Rate,Value,Gross Value,Consumption,Gross Profit,Perc %,Quantity,Rate,Value
1,155R12C ATL,300,"3,100","930,000",NaN,NaN,NaN,149,"3,130","466,300","466,300","461,900","4,400",0.94 %,151,"3,100","468,100"
2,175/70R13 GREEN ATL,290,"3,000","870,000",NaN,NaN,NaN,46,"3,026","139,200","139,200","138,000","1,200",0.86 %,244,"3,000","732,000"
3,175/70R14 ATL,186,"3,100","576,600",NaN,NaN,NaN,67,"3,131","209,800","209,800","207,700","2,100",1.00 %,119,"3,100","368,900"

In [7]:
df = pd.read_csv('Copy_ATLAS_TYRES_Stock Summary.csv')

In [8]:
df.head(5)

,Unnamed: 0,Opening Balance,Unnamed: 2,Unnamed: 3,Inwards,Unnamed: 5,Unnamed: 6,Outwards,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Closing Balance,Unnamed: 15,Unnamed: 16
0,NaN,Quantity,Rate,Value,Quantity,Rate,Value,Quantity,Rate,Value,Gross Value,Consumption,Gross Profit,Perc %,Quantity,Rate,Value
1,155R12C ATL,300,"3,100","930,000",NaN,NaN,NaN,149,"3,130","466,300","466,300","461,900","4,400",0.94 %,151,"3,100","468,100"
2,175/70R13 GREEN ATL,290,"3,000","870,000",NaN,NaN,NaN,46,"3,026","139,200","139,200","138,000","1,200",0.86 %,244,"3,000","732,000"
3,175/70R14 ATL,186,"3,100","576,600",NaN,NaN,NaN,67,"3,131","209,800","209,800","207,700","2,100",1.00 %,119,"3,100","368,900"
4,175R13C ATL,686,"4,000","2,744,000",NaN,NaN,NaN,99,"3,992","395,200","395,200","396,000",(800),-0.20 %,587,"4,000","2,348,000"

In [9]:
#df.info

In [10]:
df.columns

Index(['Unnamed: 0', 'Opening Balance', 'Unnamed: 2', 'Unnamed: 3', 'Inwards',
       'Unnamed: 5', 'Unnamed: 6', 'Outwards', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Closing Balance', 'Unnamed: 15', 'Unnamed: 16'],
      dtype='object')

Seeing that most columns have null values, I remove Opening Balance,inwards and Closing Balance columns

Outwards clearly indicates the tyres sold out in Jan-June

In [26]:
#df.drop(colname, axis=1) (or del df[colname]) is the correct method to use to delete a column.
#df.drop(df.columns[[0, 1, 3]], axis=1)  # df.columns is zero-based pd.Index 

outward_tyre = df.drop(df.columns[[1,2,3,4,5,6,14,15,16]], axis=1)

In [15]:
outward_tyre.head(5)

,Unnamed: 0,Outwards,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,NaN,Quantity,Rate,Value,Gross Value,Consumption,Gross Profit,Perc %
1,155R12C ATL,149,"3,130","466,300","466,300","461,900","4,400",0.94 %
2,175/70R13 GREEN ATL,46,"3,026","139,200","139,200","138,000","1,200",0.86 %
3,175/70R14 ATL,67,"3,131","209,800","209,800","207,700","2,100",1.00 %
4,175R13C ATL,99,"3,992","395,200","395,200","396,000",(800),-0.20 %

In [19]:
outward_tyre.info

<bound method DataFrame.info of                    Unnamed: 0    Outwards Unnamed: 8     Unnamed: 9  \
0                         NaN   Quantity       Rate          Value
1                 155R12C ATL        149      3,130        466,300
2         175/70R13 GREEN ATL         46      3,026        139,200
3               175/70R14 ATL         67      3,131        209,800
4                 175R13C ATL         99      3,992        395,200
5         185/65R15 GREEN ATL         33      4,018        132,600
6               185/70R13 ATL        944      3,139      2,963,400
7         185/70R14 GREEN ATL        713      3,270      2,331,800
8          185/70R14 LMA3 INF        449      3,401      1,527,200
9                185R14C  ATL         23      4,591        105,600
10              195/65R15 ATL        740      4,014      2,970,000
11           195R14C LMC8 ATL         75      4,800        360,000
12           195R14C LMC8 INF         64      4,800        307,200
13       195R15C GREENVAN ATL         31      5,490        170,200
14                195R15C INF         56      5,629        315,200
15        205/55R16 GREEN ATL          8      6,000         48,000
16        205/60R16 GREEN ATL         18      6,300        113,400
17              205/65R15 ATL        266      4,853      1,291,000
18              205/70R15 ATL        190      5,804      1,102,800
19                205R16C ATL         12      8,133         97,600
20  215/45R17 SPORT GREEN ATL          8      7,625         61,000
21        215/60R16 GREEN ATL          9      6,667         60,000
22             215/70R15C ATL         46      6,091        280,200
23             215/70R16C ATL        121      6,011        727,300
24  225/55R17 SPORT GREEN ATL         NaN        NaN            NaN
25              225/65R17 ATL         32      8,000        256,000
26             225/70R15C ATL         41      6,700        274,700
27  235/35R19 SPORT GREEN ATL         NaN        NaN            NaN
28              235/55R18 ATL         36      9,489        341,600
29              235/60R18 ATL         22      9,795        215,500
30             235/70R16  ATL         21      7,348        154,300
31  245/45R20 SPORT GREEN ATL         NaN        NaN            NaN
32    255/55R19 CROSSWIND ATL         NaN        NaN            NaN
33       265/70R19.5 AW09 ATL        101     14,907      1,505,600
34     385/65R22.5 APW092 ATL          8     28,250        226,000
35        9.5R17.5 AP09II ATL         78     12,841      1,001,600
36                Grand Total      4,506         NaN    20,150,300

      Unnamed: 10    Unnamed: 11     Unnamed: 12 Unnamed: 13
0    Gross Value    Consumption    Gross Profit       Perc %
1        466,300        461,900           4,400       0.94 %
2        139,200        138,000           1,200       0.86 %
3        209,800        207,700           2,100       1.00 %
4        395,200        396,000            (800)     -0.20 %
5        132,600        132,000             600       0.45 %
6      2,963,400      3,020,800         (57,400)     -1.94 %
7      2,331,800      2,424,200         (92,400)     -3.96 %
8      1,527,200      1,526,600             600       0.04 %
9        105,600        110,400          (4,800)     -4.55 %
10     2,970,000      3,015,774         (45,774)     -1.54 %
11       360,000        360,000              NaN         NaN
12       307,200        307,200              NaN         NaN
13       170,200        167,400           2,800       1.65 %
14       315,200        308,280           6,920       2.20 %
15        48,000         48,000              NaN         NaN
16       113,400        111,600           1,800       1.59 %
17     1,291,000      1,276,800          14,200       1.10 %
18     1,102,800      1,102,000             800       0.07 %
19        97,600         96,000           1,600       1.64 %
20        61,000         60,000           1,000       1.64 %
21        60,000         58,500           1,500       2.50 %
22       280,200        276,000           4,200       1.50 %
23       727,300        726,000           1,300       0.18 %
24            NaN            NaN             NaN         NaN
25       256,000        251,560           4,440       1.73 %
26       274,700        274,700              NaN         NaN
27            NaN            NaN             NaN         NaN
28       341,600        342,000            (400)     -0.12 %
29       215,500        220,000          (4,500)     -2.09 %
30       154,300        157,500          (3,200)     -2.07 %
31            NaN            NaN             NaN         NaN
32            NaN            NaN             NaN         NaN
33     1,505,600      1,494,800          10,800       0.72 %
34       226,000        228,000          (2,000)     -0.88 %
35     1,001,600        998,400           3,200       0.32 %
36    20,150,300     20,298,114        (147,814)     -0.73 %  >

In [23]:
outward_tyre.iloc[0]

Unnamed: 0                NaN
Outwards            Quantity
Unnamed: 8              Rate
Unnamed: 9             Value
Unnamed: 10      Gross Value
Unnamed: 11      Consumption
Unnamed: 12     Gross Profit
Unnamed: 13            Perc %
Name: 0, dtype: object

In [24]:
outward_tyre.columns

Index(['Unnamed: 0', 'Outwards', 'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10',
       'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13'],
      dtype='object')

In [ ]:
outward_tyre.gdp